In [1]:
import numpy as np
import pandas as pd

## NOTE
read(input) itu pandas = pd.read

write(output) itu dataframe = df.to atau namadataframe.to

## Check out the references here! 

**This is the best online resource for how to read/write to a variety of data sources!**

https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

----

<table border="1" class="colwidths-given docutils">
<colgroup>
<col width="12%" />
<col width="40%" />
<col width="24%" />
<col width="24%" />
</colgroup>
<thead valign="bottom">
<tr class="row-odd"><th class="head">Format Type</th>
<th class="head">Data Description</th>
<th class="head">Reader</th>
<th class="head">Writer</th>
</tr>
</thead>
<tbody valign="top">
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Comma-separated_values">CSV</a></td>
<td><a class="reference internal" href="#io-read-csv-table"><span class="std std-ref">read_csv</span></a></td>
<td><a class="reference internal" href="#io-store-in-csv"><span class="std std-ref">to_csv</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td><a class="reference external" href="https://www.json.org/">JSON</a></td>
<td><a class="reference internal" href="#io-json-reader"><span class="std std-ref">read_json</span></a></td>
<td><a class="reference internal" href="#io-json-writer"><span class="std std-ref">to_json</span></a></td>
</tr>
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/HTML">HTML</a></td>
<td><a class="reference internal" href="#io-read-html"><span class="std std-ref">read_html</span></a></td>
<td><a class="reference internal" href="#io-html"><span class="std std-ref">to_html</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td>Local clipboard</td>
<td><a class="reference internal" href="#io-clipboard"><span class="std std-ref">read_clipboard</span></a></td>
<td><a class="reference internal" href="#io-clipboard"><span class="std std-ref">to_clipboard</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Microsoft_Excel">MS Excel</a></td>
<td><a class="reference internal" href="#io-excel-reader"><span class="std std-ref">read_excel</span></a></td>
<td><a class="reference internal" href="#io-excel-writer"><span class="std std-ref">to_excel</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="http://www.opendocumentformat.org">OpenDocument</a></td>
<td><a class="reference internal" href="#io-ods"><span class="std std-ref">read_excel</span></a></td>
<td>&#160;</td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://support.hdfgroup.org/HDF5/whatishdf5.html">HDF5 Format</a></td>
<td><a class="reference internal" href="#io-hdf5"><span class="std std-ref">read_hdf</span></a></td>
<td><a class="reference internal" href="#io-hdf5"><span class="std std-ref">to_hdf</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://github.com/wesm/feather">Feather Format</a></td>
<td><a class="reference internal" href="#io-feather"><span class="std std-ref">read_feather</span></a></td>
<td><a class="reference internal" href="#io-feather"><span class="std std-ref">to_feather</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://parquet.apache.org/">Parquet Format</a></td>
<td><a class="reference internal" href="#io-parquet"><span class="std std-ref">read_parquet</span></a></td>
<td><a class="reference internal" href="#io-parquet"><span class="std std-ref">to_parquet</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://msgpack.org/index.html">Msgpack</a></td>
<td><a class="reference internal" href="#io-msgpack"><span class="std std-ref">read_msgpack</span></a></td>
<td><a class="reference internal" href="#io-msgpack"><span class="std std-ref">to_msgpack</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Stata">Stata</a></td>
<td><a class="reference internal" href="#io-stata-reader"><span class="std std-ref">read_stata</span></a></td>
<td><a class="reference internal" href="#io-stata-writer"><span class="std std-ref">to_stata</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SAS_(software)">SAS</a></td>
<td><a class="reference internal" href="#io-sas-reader"><span class="std std-ref">read_sas</span></a></td>
<td>&#160;</td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://docs.python.org/3/library/pickle.html">Python Pickle Format</a></td>
<td><a class="reference internal" href="#io-pickle"><span class="std std-ref">read_pickle</span></a></td>
<td><a class="reference internal" href="#io-pickle"><span class="std std-ref">to_pickle</span></a></td>
</tr>
<tr class="row-odd"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SQL">SQL</a></td>
<td><a class="reference internal" href="#io-sql"><span class="std std-ref">read_sql</span></a></td>
<td><a class="reference internal" href="#io-sql"><span class="std std-ref">to_sql</span></a></td>
</tr>
<tr class="row-even"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/BigQuery">Google Big Query</a></td>
<td><a class="reference internal" href="#io-bigquery"><span class="std std-ref">read_gbq</span></a></td>
<td><a class="reference internal" href="#io-bigquery"><span class="std std-ref">to_gbq</span></a></td>
</tr>
</tbody>
</table>

buat liat current directory

# CSV Input

In [2]:
pwd

'd:\\GitHub\\My-Python-Learning\\Jupyter Notebook\\Udemy Study\\Machine Learning\\Pandas'

buat list files di current dir

In [3]:
ls

 Volume in drive D is DATA
 Volume Serial Number is 9281-4CA0

 Directory of d:\GitHub\My-Python-Learning\Jupyter Notebook\Udemy Study\Machine Learning\Pandas

25/11/2021  22:07    <DIR>          .
25/11/2021  22:07    <DIR>          ..
09/11/2021  20:16            67.282 Combining DataFrames.ipynb
09/11/2021  12:30           217.185 Conditional Filtering and Useful Methods.ipynb
23/11/2021  21:32                51 examplecsv
09/11/2021  17:22           272.920 Groupby Operations and Multiindex.ipynb
25/11/2021  22:22            68.581 Inputs and Outputs.ipynb
09/11/2021  09:50            70.669 Missing Data.ipynb
09/11/2021  09:50           783.762 Series and DataFrames.ipynb
17/11/2021  21:11            34.075 Text Methods and String Data.ipynb
22/11/2021  21:56           101.352 Time Methods for Date and Time Data.ipynb
25/11/2021  22:07             1.333 worldtopten.html
              10 File(s)      1.617.210 bytes
               2 Dir(s)  874.540.040.192 bytes free

kalo ga pake jupyter, import os module

In [4]:
import os
os.getcwd()

'd:\\GitHub\\My-Python-Learning\\Jupyter Notebook\\Udemy Study\\Machine Learning\\Pandas'

In [5]:
df = pd.read_csv('d:\\GitHub\\My-Python-Learning\\Machine Learning\\03-Pandas\\example.csv')

In [6]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
# misal kita mau abcd bukan jadi headernya, mau masukin ke dalem row
df = pd.read_csv('d:\\GitHub\\My-Python-Learning\\Machine Learning\\03-Pandas\\example.csv', header=None)

In [8]:
df

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [9]:
df = pd.read_csv('d:\\GitHub\\My-Python-Learning\\Machine Learning\\03-Pandas\\example.csv')

In [10]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

kalo misal mau pindahin column jadi index pake index_col=

abis itu 0,1,2,3 nya tergantung mau pake a b c d

In [11]:
df = pd.read_csv('d:\\GitHub\\My-Python-Learning\\Machine Learning\\03-Pandas\\example.csv',index_col=0)

In [12]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [13]:
df = pd.read_csv('d:\\GitHub\\My-Python-Learning\\Machine Learning\\03-Pandas\\example.csv')

In [14]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# CSV Output

Set index=False if you do not want to save the index , otherwise it will add a new column to the .csv file that includes your index and call it "Unnamed: 0" if your index did not have a name. If you do want to save your index, simply set it to True (the default value).

bisa masukin file path full mau export kemana, atau kalo langsung masukin nama file aja dia bakal masuk ke directory code ini

In [15]:
df.to_csv('d:\\GitHub\\examplecsv')

In [16]:
pd.read_csv('d:\\GitHub\\examplecsv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

kalo ga mau otomatis di tambah indexnya, set index=False

In [17]:
df.to_csv('examplecsv',index=False)
# gapake path berarti ke export di path ini

In [18]:
pd.read_csv('examplecsv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## HTML

Pandas can read table tabs off of HTML. This only works if your firewall isn't blocking pandas from accessing the internet!

Unless you're running the virtual environment included with the course, you may need to install <tt>lxml</tt>, <tt>htmllib5</tt>, and <tt>BeautifulSoup4</tt>.<br>
In your terminal/command prompt run:

    conda install lxml
    
    or
    
    pip install lxml
    
Then restart Jupyter Notebook (you may need to restart your computer).
(or use pip install if you aren't using the Anaconda Distribution)

guna nya kita bisa ambil data dari website dalam bentuk html terus bisa kita pake lagi buat website kita, tapi kadang kalo di kantor ada yg firewall nya ngeblock, jadi gabisa pake link

harus ke webnya, gausah copy link, klik kanan aja, pilih view page source, abis itu save as html

# Info
buat liat table nya ada berapa, di file html nya search ctrl+F ketik '< table'
nanti bakalan muncul ada berapa, terus di dalem pandas tinggal pilih pake index number

In [19]:
import pandas as pd

In [20]:
tables = pd.read_html('https://en.wikipedia.org/wiki/World_population')

kalo liat di html nya search table juga ada 26

In [21]:
len(tables)

26

## Sekarang coba kita import salah satu table terus kita rapihin

In [22]:
tables[0]

        World population (millions, UN estimates)[15]  \
                                                    #
0                                                   1
1                                                   2
2                                                   3
3                                                   4
4                                                   5
5                                                   6
6                                                   7
7                                                   8
8                                                   9
9                                                  10
10                                                NaN
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                      Top ten most populous countries
0                                            China[B]
1                                               India
2                                       United States
3                                           Indonesia
4                                            Pakistan
5                                              Brazil
6                                             Nigeria
7                                          Bangladesh
8                                              Russia
9                                              Mexico
10                                        World total
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2000
0                                                1270
1                                                1053
2                                                 283
3                                                 212
4                                                 136
5                                                 176
6                                                 123
7                                                 131
8                                                 146
9                                                 103
10                                               6127
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2015
0                                                1376
1                                                1311
2                                                 322
3                                                 258
4                                                 208
5                                                 206
6                                                 182
7                                                 161
8                                                 146
9                                                 127
10                                               7349
11  Notes: .mw-parser-output .reflist{font-size:90...


                                              2030[A]
0                                                1416
1                                                1528
2                                                 356
3                                                 295
4                                                 245
5                                                 228
6                                                 263
7                                                 186
8                                                 149
9                                                 148
10                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...

itu tulisan world population dst nya itu index column dari multicolumnnya, kita coba buktiin

In [23]:
world_pop = tables[0]

In [24]:
world_pop.columns # kita liat susunan columnnya

MultiIndex([('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...),
            ('World population (millions, UN estimates)[15]', ...)],
           )

skrg kita mau ilangin world population dst nya biar rapi

In [25]:
# jadi kita masuk columnnya aja biar dia ga muncul sbg index lagi
world_pop = world_pop['World population (millions, UN estimates)[15]']

In [26]:
world_pop.head()

   # Top ten most populous countries  2000  2015 2030[A]
0  1                        China[B]  1270  1376    1416
1  2                           India  1053  1311    1528
2  3                   United States   283   322     356
3  4                       Indonesia   212   258     295
4  5                        Pakistan   136   208     245

nah skrg kita liat rank(#) nya itu sama kaya indexnya, kita drop aja ranknya

In [27]:
world_pop = world_pop.drop('#',axis=1) #axis 1 inget soalnya column

In [28]:
world_pop

,Top ten most populous countries,2000,2015,2030[A]
0,China[B],1270,1376,1416
1,India,1053,1311,1528
2,United States,283,322,356
3,Indonesia,212,258,295
4,Pakistan,136,208,245
5,Brazil,176,206,228
6,Nigeria,123,182,263
7,Bangladesh,131,161,186
8,Russia,146,146,149
9,Mexico,103,127,148
10,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

skrg kita rapihin nama columnya, terlalu acak, sama kita drop row 11 nya karena kita ga butuh infonya

In [29]:
world_pop.columns

Index(['Top ten most populous countries', '2000', '2015', '2030[A]'], dtype='object')

In [30]:
world_pop.columns = ['Countries','2000','2015','2030 Est.']
world_pop = world_pop.drop(11,axis=0)

In [31]:
world_pop

        Countries  2000  2015 2030 Est.
0        China[B]  1270  1376      1416
1           India  1053  1311      1528
2   United States   283   322       356
3       Indonesia   212   258       295
4        Pakistan   136   208       245
5          Brazil   176   206       228
6         Nigeria   123   182       263
7      Bangladesh   131   161       186
8          Russia   146   146       149
9          Mexico   103   127       148
10    World total  6127  7349      8501

### Kadang kita bisa hoki dapet table yg udah rapih, jadi kita gausah rapihin lagi, contoh

In [32]:
tables[5] # ini udah ready to go bisa langsung di pake
# paling kita jadiin ranknya index aja

   Rank      Country  Population  Area(km2)  Density(pop/km2)
0     1    Singapore     5704000        710              8033
1     2   Bangladesh   171780000     143998              1193
2     3    Palestine     5266785       6020               847
3     4      Lebanon     6856000      10452               656
4     5       Taiwan    23604000      36193               652
5     6  South Korea    51781000      99538               520
6     7       Rwanda    12374000      26338               470
7     8        Haiti    11578000      27065               428
8     9  Netherlands    17660000      41526               425
9    10       Israel     9440000      22072               428

In [33]:
tables[5].set_index('Rank')

          Country  Population  Area(km2)  Density(pop/km2)
Rank
1       Singapore     5704000        710              8033
2      Bangladesh   171780000     143998              1193
3       Palestine     5266785       6020               847
4         Lebanon     6856000      10452               656
5          Taiwan    23604000      36193               652
6     South Korea    51781000      99538               520
7          Rwanda    12374000      26338               470
8           Haiti    11578000      27065               428
9     Netherlands    17660000      41526               425
10         Israel     9440000      22072               428

outputnya kurang lebih sama semua, nama dataframe.to_html

In [34]:
world_pop.to_html('worldtopten.html',index=False)

# Excel Files

Pandas can read in basic excel files (it will get errors if there are macros or extensive formulas relying on outside excel files), in general, pandas can only grab the raw information from an .excel file.

#### NOTE: Requires the openpyxl and xlrd library! Its provided for you in our environment, or simply install with:

    pip install openpyxl
    pip install xlrd
    
Heavy excel users may want to check out this website: https://www.python-excel.org/

You can think of an excel file as a Workbook containin sheets, which for pandas means each sheet can be a DataFrame.

## Excel file input with read_excel()

In [37]:
# masukin parameter sheet name nya pas read
# kalo gatau sheet itu apa coba buka excel ada di kiri bawah sheetnya

In [35]:
dfe = pd.read_excel('d:\\GitHub\\My-Python-Learning\\Machine Learning\\03-Pandas\\my_excel_file.xlsx',sheet_name='First_Sheet')

In [36]:
dfe

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## fyi

#### jadi pandas itu memperlakukan excel itu sebagai dictionary, dimana key nya itu nama sheetnya, valuenya itu isi sheetnya dalam bentuk dataframe

### kalo misal excel file kita banyak bgt sheetsnya kayak notebook, terus kita gatau ada sheet apa aja, kita bisa loop through semua sheetnya

In [38]:
# kita bisa pake command pd.ExcelFile
wb = pd.ExcelFile('d:\\GitHub\\My-Python-Learning\\Machine Learning\\03-Pandas\\my_excel_file.xlsx')

In [39]:
# buat ngelist semua nama sheetnya
wb.sheet_names

['First_Sheet']

## tapi cara yg lebih common kayak gini

In [42]:
# kan pandas ngetreat file excel sbg dict jadi kita bisa list keysnya
# sheetname nya none, jadi kita import semua sheet
excel_sheet_dict = dfe = pd.read_excel('d:\\GitHub\\My-Python-Learning\\Machine Learning\\03-Pandas\\my_excel_file.xlsx',sheet_name=None)

In [43]:
type(excel_sheet_dict)

dict

In [45]:
excel_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [46]:
# kita coba liat value dari keys ini
excel_sheet_dict['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [47]:
excel_sheet_dict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

#### Sekarang cara exportnya, kan kalo export selalu harus dataframenya, jadi kita pisahin dulu valuenya sebagai dataframe

In [48]:
our_df = excel_sheet_dict['First_Sheet']

In [49]:
our_df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [50]:
# kayak biasa formatnya
our_df.to_excel('example.xlsx',sheet_name='SHEET',index=False)

In [51]:
# kalo misal nama filenya udh ada, terus sheetname nya sama bakal ke overwrite

# SQL Connections

#### NOTE: Highly recommend you explore specific libraries for your specific SQL Engine. Simple search for your database+python in Google and the top results should hopefully include an API.

* [MySQL](https://www.google.com/search?q=mysql+python)
* [PostgreSQL](https://www.google.com/search?q=postgresql+python)
* [MS SQL Server](https://www.google.com/search?q=MSSQLserver+python)
* [Orcale](https://www.google.com/search?q=oracle+python)
* [MongoDB](https://www.google.com/search?q=mongodb+python)

Let's review pandas capabilities by using SQLite, which comes built in with Python.

## Example SQL Database (temporary in your RAM)

You will need to install sqlalchemy with:

    pip install sqlalchemy
    
to follow along. To understand how to make a connection to your own database, make sure to review: https://docs.sqlalchemy.org/en/13/core/connections.html

In [52]:
# case untuk SQL banyak, disini kita cuma coba pake SQL Lite
# bakalan banyak google search
# untuk detailsnya nonton ulang video Jose buat section ini

In [53]:
from sqlalchemy import create_engine

In [54]:
# kita buat temp database di ram kita
temp_db = create_engine('sqlite:///:memory:')

In [56]:
# kita coba write database ke ram
tables[5]

   Rank      Country  Population  Area(km2)  Density(pop/km2)
0     1    Singapore     5704000        710              8033
1     2   Bangladesh   171780000     143998              1193
2     3    Palestine     5266785       6020               847
3     4      Lebanon     6856000      10452               656
4     5       Taiwan    23604000      36193               652
5     6  South Korea    51781000      99538               520
6     7       Rwanda    12374000      26338               470
7     8        Haiti    11578000      27065               428
8     9  Netherlands    17660000      41526               425
9    10       Israel     9440000      22072               428

In [57]:
population = tables[5]

In [58]:
# notes kalo database nya lebih gede dari RAM kita, pandas bakalan nolak buat write

In [59]:
population.to_sql(name='populations',con=temp_db,index=False)

In [61]:
# kalo udh exist dia bakalan error
# ada 3 pilihan kalo exist bisa liat di docsnya to_sql
# hati2 kalo pilih replace, datanya bisa ilang ke overwrite
population.to_sql(name='populations',con=temp_db,index=False)

ValueError: Table 'populations' already exists.

In [62]:
pd.read_sql(sql='populations',con=temp_db)

   Rank      Country  Population  Area(km2)  Density(pop/km2)
0     1    Singapore     5704000        710              8033
1     2   Bangladesh   171780000     143998              1193
2     3    Palestine     5266785       6020               847
3     4      Lebanon     6856000      10452               656
4     5       Taiwan    23604000      36193               652
5     6  South Korea    51781000      99538               520
6     7       Rwanda    12374000      26338               470
7     8        Haiti    11578000      27065               428
8     9  Netherlands    17660000      41526               425
9    10       Israel     9440000      22072               428

In [63]:
# SQL Query buat read
pd.read_sql_query(sql='SELECT Country FROM populations',con=temp_db)

       Country
0    Singapore
1   Bangladesh
2    Palestine
3      Lebanon
4       Taiwan
5  South Korea
6       Rwanda
7        Haiti
8  Netherlands
9       Israel